In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd()  # 현재 경로 가져오기

'C:\\Users\\sjy\\TIL\\04_data\\230130'

In [3]:
# titanic_data_frame = pd.read_csv('./train.csv')
titan_df = pd.read_csv('./train.csv')

In [4]:
print('DF의 형태: ', titan_df.shape)

DF의 형태:  (891, 12)

In [5]:
# info()
titan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
titan_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
titan_df.head(3)  # 세줄만 출력

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 단일 요소 추출

In [8]:
# position_based_indexing (위치 기반 인덱싱)
# iloc 함수
titan_df.iloc[0, 3]

# label_based_indexing (명칭 기반 인덱싱)
# loc 함수
titan_df.loc[0, 'Name']

'Braund, Mr. Owen Harris'

#### 원하는 컬럼 가져오기

In [9]:
# 1차원
type(titan_df['Name'])

pandas.core.series.Series

In [10]:
# 2차원
type(titan_df)

pandas.core.frame.DataFrame

In [11]:
# 2차원 - 'Pclass', 'Name', 'Age' 일부 추출
titan_df[['Pclass', 'Name', 'Age']].head()  # 5줄만 출력

   Pclass                                               Name   Age
0       3                            Braund, Mr. Owen Harris  22.0
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2       3                             Heikkinen, Miss. Laina  26.0
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4       3                           Allen, Mr. William Henry  35.0

#### value_counts() 함수

- .value_counts() 로 수치만 볼수있다.

In [12]:
titan_df[['Sex']].value_counts()

Sex
male      577
female    314
dtype: int64

In [13]:
titan_df[['Pclass', 'Sex']].value_counts()

Pclass  Sex
3       male      347
        female    144
1       male      122
2       male      108
1       female     94
2       female     76
dtype: int64

#### 행과 열 추가 삭제

In [14]:
# 열을 추가하자
titan_df['Age_10'] = 10
titan_df

# 파생변수 생성 => 연구자의 논리적 주관에 따라 데이터 정보에 맞게 생성된 변수
titan_df['Fam_no'] = titan_df.SibSp + titan_df.Parch + 1

titan_df['Age_by_100'] = titan_df.Age * 100
titan_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_10,Fam_no,Age_by_100
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,10,2,2200.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,10,2,3800.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,10,1,2600.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,10,2,3500.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,10,1,3500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,10,1,2700.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,10,1,1900.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,10,4,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,10,1,2600.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,10,1,3200.0

In [15]:
titan_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_10', 'Fam_no',
       'Age_by_100'],
      dtype='object')

In [18]:
# drop() 함수를 활용한 열 삭제
# 1. 원본에서 컬럼을 지우는 방법
titan_df.drop("Fam_no")  # error 뜨네?

KeyError: "['Fam_no'] not found in axis"